dictionary.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>Glossário de termos</title>
<!-- 2019-03-06 Wed 05:32 -->
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="generator" content="Org-mode" />
<meta  name="author" content="Gilgamesh" />
<link rel="stylesheet" type="text/css" href="/org-theme/dist/short/bundle.min.css"/>
<link rel="stylesheet" type="text/css" href="/css/syntax.css" />
</head>
<body>
<div id="content">
<h1 class="title">Glossário de termos</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1. A</a></li>
<li><a href="#sec-2">2. F</a></li>
<li><a href="#sec-3">3. L</a></li>
<li><a href="#sec-4">4. P</a></li>
<li><a href="#sec-5">5. R</a></li>
<li><a href="#sec-6">6. S</a></li>
<li><a href="#sec-7">7. T</a></li>
</ul>
</div>
</div>

<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> A</h2>
<div class="outline-text-2" id="text-1">
<p>
<b>Átoms</b> (<i>átomos</i>): Em Lisp, átomos é uma palavra para todos os tipos de dados que não são sequências.
</p>

<p>
<i>Exemplos de átomos: números e caracteres.</i>
</p>

<p>
Referência: <a href="https://www.gnu.org/software/emacs/manual/html_node/eintr/Lisp-Atoms.html">Lisp Atoms - Programming in Emacs Lisp</a>.
</p>
</div>
</div>
<div id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2"><span class="section-number-2">2</span> F</h2>
<div class="outline-text-2" id="text-2">
<p>
<b>Form</b> (<i>forma</i>): Uma "<i>forma</i>" é uma lista onde o primeiro símbolo na lista tem que ser uma palavra especial que o compilador pode entender (<i>geralmente o nome de uma função</i>).
</p>

<p>
<i>Exemplos de formas: (+ 3 5 3)</i>
</p>

<p>
Referências: <a href="https://www.gnu.org/software/emacs/manual/html_node/elisp/Forms.html">Forms - GNU Emacs Lisp Reference Manual</a>, <a href="http://www.lisperati.com/syntax.htlm">Lispirati - Syntax and Semantics</a>.
</p>
</div>
</div>
<div id="outline-container-sec-3" class="outline-2">
<h2 id="sec-3"><span class="section-number-2">3</span> L</h2>
<div class="outline-text-2" id="text-3">
<p>
<b>Lisp Machine</b>: Um computador criado especialmente para rodar Lisp de forma eficiente, como seu software principal e linguagem de programação, usualmente via suporte de hardware.
</p>

<p>
Referência: <a href="https://en.wikipedia.org/wiki/Lisp_machine">Lisp Machine - Wikipedia</a>.
</p>
</div>
</div>
<div id="outline-container-sec-4" class="outline-2">
<h2 id="sec-4"><span class="section-number-2">4</span> P</h2>
<div class="outline-text-2" id="text-4">
<p>
<b>Polish Notation</b> (<i>Notação polonesa</i>): Uma forma de notação matemática onde os operadores precedem os operandos.
</p>

<p>
<i>Exemplos: "+ 3 4", onde o resultado será 7.</i>
</p>

<p>
Referência: <a href="https://en.wikipedia.org/wiki/Polish_notation">Polish Notation - Wikipedia</a>.
</p>

<p>
<b>Predicate</b> (<i>Predicado</i>): Um predicado é uma função que testa alguma condição envolvendo seus argumentos e retorna <i>nil</i> se a condição for falsa (<i>false</i>), ou algum valor não-/nil/ se a condição for verdadeira (<i>true</i>).
</p>

<p>
<i>Exemplos: (listp '(a b c))</i>
</p>

<p>
Referência: <a href="https://www.cs.cmu.edu/Groups/AI/html/cltl/clm/node69.html">Common Lisp the Language - 6. Predicates</a>.
</p>

<p>
<b>Packages</b> (<i>Pacotes</i>): <i>Pacotes</i> são, de grosso modo, contêineres para símbolos. Eles estão ali para ajudar você a criar <i>namespaces</i> separados dentro de seus programas.
</p>

<p>
Referências: <a href="http://mirror.informatimago.com/lisp/weitz.de/packages.html">Packages, systems, modules, libraries - WTF?</a>, <a href="http://gigamonkeys.com/book/programming-in-the-large-packages-and-symbols.html">Practical Common Lisp - 21. Programming in the Large: Packages and Symbols</a>.
</p>
</div>
</div>

<div id="outline-container-sec-5" class="outline-2">
<h2 id="sec-5"><span class="section-number-2">5</span> R</h2>
<div class="outline-text-2" id="text-5">
<p>
<b>REPL</b> (<i>Read-Eval-Print-Loop</i>): Termo para um ambiente interativo que lê a entrada do usuário, avalia a expressão de entrada e retorna o resultado para o usuário.
</p>

<p>
Referência: <a href="https://en.wikipedia.org/wiki/Read%E2%80%93eval%E2%80%93print_loop">Read-Eval-Print Loop - Wikipedia</a>.
</p>
</div>
</div>
<div id="outline-container-sec-6" class="outline-2">
<h2 id="sec-6"><span class="section-number-2">6</span> S</h2>
<div class="outline-text-2" id="text-6">
<p>
<b>SLIME</b> (<i>The Superior Lisp Interaction Mode for Emacs</i>): Um modo para o Emacs, para desenvolver aplicações em Common Lisp.
</p>

<p>
Referências: <a href="https://common-lisp.net/project/slime/">SLIME</a>, <a href="https://en.wikipedia.org/wiki/SLIME">SLIME - Wikipedia</a>.
</p>
</div>
</div>
<div id="outline-container-sec-7" class="outline-2">
<h2 id="sec-7"><span class="section-number-2">7</span> T</h2>
<div class="outline-text-2" id="text-7">
<p>
<b>TL;DR</b> (<i>too long; didn't read</i>): Termo geralmente usado por alguém que escreveu um texto muito longo para poder mostrar um breve resumo do texto.
</p>

<p>
Referência: <a href="https://www.urbandictionary.com/define.php?term=tl;dr">Urban Dictionary: tl;dr</a>.
</p>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="date">Date: 2019-03-03</p>
<p class="author">Author: Gilgamesh</p>
<p class="date">Created: 2019-03-06 Wed 05:32</p>
<p class="creator"><a href="http://www.gnu.org/software/emacs/">Emacs</a> 25.1.1 (<a href="http://orgmode.org">Org</a> mode 8.2.10)</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
